{
    "scenes": [
        {
            "scene_id": "start_scene",
            "text": "Начальные инструкции: вам предстоит проникнуть через ледяные завалы и скрытые проходы для входа в бункер.",
            "choices": [
                {
                    "text": "Попытаться найти секретный проход (1)",
                    "after": "Ваша рука натыкается на карманного мутанта, торгующего артефактами. Он предлагает вам планы бункера за цену.",
                    "next_scene_id": "scene3"
                },
                {
                    "text": "Попробовать проломить завал напрямую (2)",
                    "after": "Слишком тяжело для одиночного героя, вы решили не рисковать и вернулись к мутантам.",
                    "next_scene_id": "scene1"
                }
            ]
        },
        {
            "scene_id": "scene3",
            "text": "Вы решаете вести переговоры с мутантом. Он предлагает вам информацию за два радиоактивных камня и три аудиозаписи.",
            "choices": [
                {
                    "text": "Принимать предложение (1)",
                    "after": "Мутант выдает планы, но настораживает вас своим странным взглядом.",
                    "next_scene_id": "scene5"
                },
                {
                    "text": "Отказаться и искать другие пути (2)",
                    "after": "Вы не доверяете его намерениям. Вам нужны дополнительные доказательства, прежде чем продолжить.",
                    "next_scene_id": "fail3"
                }
            ]
        },
        {
            "scene_id": "scene1",
            "text": "Пытаясь найти секретный проход, вы замечаете странный символ на стене. Вдруг земля начинает поддаваться и образуется узкий проход.",
            "choices": [
                {
                    "text": "Продолжить идти дальше (1)",
                    "after": "Кажется, что проход ведет в неизвестное место, но он слишком узкий для вас без протеза. Вы вынуждены вернуться к основному пути.",
                    "next_scene_id": "scene4"
                },
                {
                    "text": "Проверить стену на предмет аномалий (2)",
                    "after": "Вы обнаруживаете, что проход обманчиво ведёт в ловушку. Возвращайтесь и ищите другой путь.",
                    "next_scene_id": "fail0"
                }
            ]
        },
        {
            "scene_id": "scene4",
            "text": "Вернувшись к мутантам, вы решаете использовать их информацию. Вы получили полные планы и описание системы безопасности.",
            "choices": [
                {
                    "text": "Попытаться найти вход (1)",
                    "after": "Вы обнаруживаете спрятанную дверь в конце длинного коридора, но она закрыта мощным замком.",
                    "next_scene_id": "scene6"
                },
                {
                    "text": "Отправиться к бункеру за поддержкой (2)",
                    "after": "Мутант предлагает вам свои услуги по взлому дверей в обмен на редкий артефакт.",
                    "next_scene_id": "scene7"
                }
            ]
        },
        {
            "scene_id": "scene5",
            "text": "Решив продолжить, вы начинаете движение дальше. Внезапно стены бункера начинают шепотом вещать о «нечистых» и предупреждать вас.",
            "choices": [
                {
                    "text": "Продолжите идти, несмотря на шёпоты (1)",
                    "after": "Следуя планам мутанта, вы оказываетесь в лаборатории с множеством аномалий и артефактов.",
                    "next_scene_id": "scene8"
                },
                {
                    "text": "Вернуться к мутанту за помощью (2)",
                    "after": "Вы не выдерживаете шепотов и паникуете. Вы выходите из бункера, решив, что без помощи никак.",
                    "next_scene_id": "fail1"
                }
            ]
        },
        {
            "scene_id": "final0",
            "text": "Вы нашли дверь в бункер и решили вернуться к мутанту за помощью. Но он не смог вам помочь. Вместо этого, он предложил провести вас через опасные зоны.",
            "choices": [
                {
                    "text": "[ФИНАЛ] Продолжить с его помощью (1)",
                    "after": "Вы проходите через аномалии и находите точку входа в бункер. Мутант исчезает, предоставив вам шанс.",
                    "next_scene_id": ""
                },
                {
                    "text": "[ФИНАЛ] Отказаться от помощи (2)",
                    "after": "Вы вынуждены оставить попытки и вернуться к началу.",
                    "next_scene_id": "fail0"
                }
            ]
        },
        {
            "scene_id": "final1",
            "text": "Ваше упорство оправдалось, когда вы нашли дверь. Внутри оказалось полно артефактов и лабораторных записей.",
            "choices": [
                {
                    "text": "[ФИНАЛ] Выбирай, что искать в первую очередь (1: Артефакты / 2: Записи)",
                    "after": "Если вы выбрали артефакты — найдены редкие образцы. Если записи — найден подробный дневник учёных.",
                    "next_scene_id": ""
                }
            ]
        },
        {
            "scene_id": "final2",
            "text": "Вы решили продолжить путь самостоятельно, несмотря на предупреждения мутанта. Внутри бункера вас ожидает хитрое западло — ловушка из аномалий.",
            "choices": [
                {
                    "text": "[ФИНАЛ] Использовать артефакты для преодоления (1)",
                    "after": "Вы используете мощный артефакт, чтобы обойти блокировку и продолжаете движение. Бункер оказался полон опасностей.",
                    "next_scene_id": ""
                },
                {
                    "text": "[ФИНАЛ] Вернуться (2)",
                    "after": "Возвращение стало единственным выходом из сложившейся ситуации, но вы нашли образцы «Зелёного кода» на обратном пути.",
                    "next_scene_id": ""
                }
            ]
        },
        {
            "scene_id": "final3",
            "text": "Вы решили не слушать мутанта и попытаться проломить завалы напрямую. Оказавшись перед бункером, вы понимаете, что это была плохая идея.",
            "choices": [
                {
                    "text": "[ФИНАЛ] Решите продолжить (1)",
                    "after": "Вы решительно идете вперёд и находите вход. Но он полностью заблокирован защитными полями.",
                    "next_scene_id": ""
                },
                {
                    "text": "[ФИНАЛ] Уйти и пересмотреть планы (2)",
                    "after": "Не желая рисковать, вы возвращаетесь назад и снова пробуете найти проход через мутантов.",
                    "next_scene_id": "fail0"
                }
            ]
        },
        {
            "scene_id": "final4",
            "text": "Вы решаете принять предложение мутанта и использовать его информацию для проникновения. Вскоре вы находите вход в бункер.",
            "choices": [
                {
                    "text": "[ФИНАЛ] Продолжить (1)",
                    "after": "С помощью плана, предоставленного мутантом, вам удается пробраться внутрь без проблем и найти образцы «Зелёного кода».",
                    "next_scene_id": ""
                }
            ]
        },
        {
            "scene_id": "fail3",
            "text": "Отказавшись от помощи мутанта, вы снова оказались в тупике. В конце концов, вам не удалось найти вход в бункер.",
            "choices": [
                {
                    "text": "[ФИНАЛ] Вернуться к началу (1)",
                    "after": "Вы решаетесь на вторую попытку через старый проход.",
                    "next_scene_id": "start_scene"
                }
            ]
        },
        {
            "scene_id": "fail2",
            "text": "Ваша неудачная попытка найти дверь приводит к тому, что вы проваливаетесь в подземную реку. Вы выбираетесь благодаря протезу.",
            "choices": [
                {
                    "text": "[ФИНАЛ] Вернуться на исходное место (1)",
                    "after": "Вы решаете вернуться и найти другой, более безопасный проход.",
                    "next_scene_id": "start_scene"
                }
            ]
        },
        {
            "scene_id": "fail1",
            "text": "Вернувшись к мутанту за помощью, вы не смогли убедить его. Он отказался вам помочь и скрылся в тумане.",
            "choices": [
                {
                    "text": "[ФИНАЛ] Вернуться к началу (1)",
                    "after": "Вы решаетесь на повторную попытку, но уже с новыми планами.",
                    "next_scene_id": "start_scene"
                }
            ]
        },
        {
            "scene_id": "fail0",
            "text": "Другой проход оказался ловушкой. Вы решили вернуться к началу и не нашли вход в бункер.",
            "choices": [
                {
                    "text": "[ФИНАЛ] Вернуться на старое место (1)",
                    "after": "Вернитесь туда, где вы уже были. Возможно, найдёте другой путь.",
                    "next_scene_id": "start_scene"
                }
            ]
        },
        {
            "scene_id": "scene6",
            "text": "Вы используете планы мутанта и находите вход в бункер через потайную дверь. Она открывается с помощью редкого артефакта.",
            "choices": [
                {
                    "text": "Продолжить (1)",
                    "after": "Двери открыты, вы проникаете внутрь и начинаете поиски.",
                    "next_scene_id": "scene8"
                }
            ]
        },
        {
            "scene_id": "scene7",
            "text": "Вы решаете обратиться к мутанту за помощью. Он соглашается, но требует плату вперёд — один артефакт.",
            "choices": [
                {
                    "text": "Предоставить артефакт (1)",
                    "after": "С его помощью вам удается открыть дверь и проникнуть в бункер. Мутант исчезает, как только вы оказались внутри.",
                    "next_scene_id": "scene8"
                },
                {
                    "text": "Не предоставлять артефакт (2)",
                    "after": "Мутант отказывается от помощи без оплаты и уходит.",
                    "next_scene_id": "fail1"
                }
            ]
        },
        {
            "scene_id": "scene8",
            "text": "Внутри бункера вы оказались в лабиринте из множества аномалий. Внезапно, вы слышите шёпот: «...Не забывай о кодах.»",
            "choices": [
                {
                    "text": "[ФИНАЛ] Продолжить поиск (1)",
                    "after": "Вы продолжаете идти дальше и находите лабораторию, где хранится Зелёный Код.",
                    "next_scene_id": ""
                },
                {
                    "text": "Вернуться к началу (2)",
                    "after": "Паника начинает овладевать вами. Вы решаете не рисковать дальше и вернуться на исходную точку.",
                    "next_scene_id": "fail0"
                }
            ]
        }
    ]
}
